c5/src/Enums/Reminder/Reminder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Reminder</name>
  <enumValues>
    <name>None</name>
  </enumValues>
  <enumValues>
    <name>_5m</name>
  </enumValues>
  <enumValues>
    <name>_15m</name>
  </enumValues>
  <enumValues>
    <name>_30m</name>
  </enumValues>
  <enumValues>
    <name>_1h</name>
  </enumValues>
  <enumValues>
    <name>_1d</name>
  </enumValues>
  <enumValues>
    <name>_1w</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Reminder/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Function GetDate ( Date, Variant ) export
	
	if ( Variant = Enums.Reminder._5m ) then
		seconds = 300;
	elsif ( Variant = Enums.Reminder._15m ) then
		seconds = 900;
	elsif ( Variant = Enums.Reminder._30m ) then
		seconds = 1800;
	elsif ( Variant = Enums.Reminder._1h ) then
		seconds = 3600;
	elsif ( Variant = Enums.Reminder._1d ) then
		seconds = 86400;
	elsif ( Variant = Enums.Reminder._1w ) then
		seconds = 604800;
	endif; 
	return Date - seconds;
	
EndFunction

#endif
